{
  "1": {
    "title": "What Is This Website?",
    "date": "May 4th, 2021",
    "body": "<p id>This website is here for me to build whatever I want, when I want, and to not have any more excuses. I&#x27;ve tried time and time again to start a side project, get a hobby, put myself out there, to just DO SOMETHING. But I struggle very hard with thinking that whatever I do has to be perfect. It has to be meticulously planned and flawlessly executed in order for it to be worth anything. But I know deep down that thinking that way is really just an excuse not to do anything at all. It&#x27;s as if by telling myself that if I were to do something it would be perfect, makes it ok to just do nothing instead.</p><p>This website is my way of telling myself to cut the bullshit, and just start working on something. It doesn&#x27;t matter how perfect something is in my head if I never actually try to make it.</p><p>This website is my playground. This is where I get to build my own stuff without excuses and without fear of making it perfect. It&#x27;s going to be ugly in the beginning, and that&#x27;s ok. I have to be okay with that if I&#x27;m going to make anything at all. But hopefully I&#x27;ll keep working on it, keep making it better, and make myself better in the process. </p><p>Throughout it all, I plan to share my thoughts, plans, and experiences through this blog. That part of this project is a big task for me, because if you haven&#x27;t figured it out already, I am not a writer. I dreamed of becoming a famous author as a kid, but the reality is, I don&#x27;t write. I don&#x27;t even journal. But I want to have this blog as my place to reflect and look back on my past experiences. So I apologize to whomever is reading this for my rambling sentences and grammar mistakes, I&#x27;m surprised you&#x27;ve even made it this far. The whole point of this website, and this blog is to be ok with imperfection. So I don&#x27;t plan on revising this post until I&#x27;m happy with it, because I never will be. Instead I will focus on just writing, and putting this out there. No matter the end result.</p><p>So what&#x27;s the point of this? What even is this website?  - To tell the truth, it&#x27;s my own personal hot mess, and I love it.</p><h1>Plans</h1><p>This first step for this website is to just get it online. There are a lot of hidden steps in &quot;just get it online&quot;, but that is the focus. I&#x27;m not going to care about proper styling or design, or about setting up a database for my blog posts, or any kind of testing or deployment steps. My <em>only</em> goal, is set up a project, and get it hosted.</p><p>After that, it&#x27;s all about iterations. I should set up a DB for the blog posts, add search, start adding some design elements, add more content in general, maybe I&#x27;ll get fancy and make a chat bot AI of myself. Who knows! The whole point is that I get to do whatever I want.</p><p>The only element to this website that I would love have that might need at least a little up front planning, is to have some kind of &quot;time machine&quot; where you could go back and see previous iterations. Imagine I get to version 20, and the website looks nice, it has lots of content, animations, and 100 blog posts. But if you &quot;time travel&quot; to version 1, you get to see this. This version. Just a single blog post and some plain HTML. That&#x27;s something I really want, because it will let me see how far I&#x27;ve come.</p><p>The problem with that is managing different versions of components, styles, and features. How do I make clear divisions between the versions? It will probably be a matter of good organization and file structure. Something I&#x27;m not <em>particularly</em> good at. But That&#x27;s the point, isn&#x27;t it! </p><h1>Conclusion</h1><p>Essentially, this website is for me, and you&#x27;re welcome to visit anytime :)</p><p>"
  }
}
